sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cltcfg.h
/*!
    \file    gd32a7xx_cltcfg.h
    \brief   definitions for the CLTCFG

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_CLTCFG_H
#define GD32A7XX_CLTCFG_H

#include "gd32a7xx.h"

#define CLTCFG                                CLTCFG_BASE                                  /*!< CLTCFG base address */

/* registers definitions */
#define CLTCFG_SR_STAT0                       REG32((CLTCFG) + 0x00000000U)                /*!< system reset status register 0 */
#define CLTCFG_SR_STAT1                       REG32((CLTCFG) + 0x00000004U)                /*!< system reset status register 1 */
#define CLTCFG_SR_STAT2                       REG32((CLTCFG) + 0x00000008U)                /*!< system reset status register 2 */
#define CLTCFG_SUBSR_STAT0                    REG32((CLTCFG) + 0x0000000CU)                /*!< subsystem reset status register 0 */
#define CLTCFG_SUBSR_STAT1                    REG32((CLTCFG) + 0x00000010U)                /*!< subsystem reset status register 1 */
#define CLTCFG_SUBSR_STAT2                    REG32((CLTCFG) + 0x00000014U)                /*!< subsystem reset status register 2 */
#define CLTCFG_POR_CTL0                       REG32((CLTCFG) + 0x00000018U)                /*!< power-on reset control register 0 */
#define CLTCFG_POR_CTL1                       REG32((CLTCFG) + 0x0000001CU)                /*!< power-on reset control register 1 */
#define CLTCFG_SR_CTL0                        REG32((CLTCFG) + 0x00000020U)                /*!< system reset control reister 0 */
#define CLTCFG_SR_CTL1                        REG32((CLTCFG) + 0x00000024U)                /*!< system reset control reister 1 */
#define CLTCFG_SUBSR_CTL0                     REG32((CLTCFG) + 0x00000028U)                /*!< subsystem reset control reister 0 */
#define CLTCFG_SUBSR_CTL1                     REG32((CLTCFG) + 0x0000002CU)                /*!< subsystem reset control reister 1 */
#define CLTCFG_SUBSR_CTL2                     REG32((CLTCFG) + 0x00000030U)                /*!< subsystem reset control reister 2 */
#define CLTCFG_TMR_CTL                        REG32((CLTCFG) + 0x00000034U)                /*!< triple modular redundancy control register */
#define CLTCFG_TMR_STAT                       REG32((CLTCFG) + 0x00000038U)                /*!< triple modular redundancy status register */
#define CLTCFG_TMR_FC                         REG32((CLTCFG) + 0x0000003CU)                /*!< triple modular redundancy flag clear register */
#define CLTCFG_LC_CS                          REG32((CLTCFG) + 0x00000040U)                /*!< life cycle control and status register */

/* bits definitions */
/* CLTCFG_SR_STAT0 */
#define CLTCFG_SR_STAT0_ISO_STAT              BIT(0)                                       /*!< PMU input isolation state */

/* CLTCFG_SR_STAT1 */
#define CLTCFG_SR_STAT1_RSTPIN_MOD            BIT(0)                                       /*!< the reset pin mode state */

/* CLTCFG_SR_STAT2 */
#define CLTCFG_SR_STAT2_FFIOMOD               BIT(31)                                      /*!< the fatal fault IO mode state */

/* CLTCFG_SUBSR_STAT0 */
#define CLTCFG_SUBSR_STAT0_ENET_CH0_STAT      BIT(0)                                       /*!< enet DMA channel 0 state */
#define CLTCFG_SUBSR_STAT0_ENET_CH1_STAT      BIT(1)                                       /*!< enet DMA channel 1 state */

/* CLTCFG_SUBSR_STAT1 */
#define CLTCFG_SUBSR_STAT1_PWDGEN_STAT        BIT(0)                                       /*!< indicates the POR watchdog status is enabled or disabled in the option bytes */
#define CLTCFG_SUBSR_STAT1_FSRDIS_STAT        BIT(1)                                       /*!< final_step regulator automatic crossover from boot regulation feature support */
#define CLTCFG_SUBSR_STAT1_SRUG               BITS(18,31)                                  /*!< indciactes the information of chip system reset esscalation support for system reset sources as configured in the option bytes */

/* CLTCFG_SUBSR_STAT2 */
#define CLTCFG_SUBSR_STAT2_SRUG               BITS(0,17)                                   /*!< indciactes the information of chip system reset esscalation support for system reset sources as configured in the option bytes */

/* CLTCFG_POR_CTL0 */ 
#define CLTCFG_POR_CTL0_CKOUT1_CFG            BIT(3)                                       /*!< clockout standy expose over system reset and subsystem reset */
#define CLTCFG_POR_CTL0_PWD_MONDIS            BIT(8)                                       /*!< disable the standy entry and exit monitor of por watchdog */
#define CLTCFG_POR_CTL0_PWDTO                 BITS(9,10)                                   /*!< configure timeout value of the por watchdog */

/* CLTCFG_POR_CTL1 */
#define CLTCFG_POR_CTL1_FMU_MONDIS            BIT(0)                                       /*!< disable FMU monitor */
#define CLTCFG_POR_CTL1_LOLINT_CFG            BIT(9)                                       /*!< configuation of PLL loss of lock event */

/* CLTCFG_SR_CTL0 */
#define CLTCFG_SR_CTL0_STOSSREN               BIT(13)                                      /*!< enable slow trace over subsystem reset */
#define CLTCFG_SR_CTL0_FTOSSREN               BIT(14)                                      /*!< enable fast trace over subsystem reset */

