sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cltcfg.h
/* CLTCFG_SR_CTL1 */
#define CLTCFG_SR_CTL1_FRCFG                  BIT(7)                                       /*!< cconfiguration of the the fault reaction state during selftest */

/* CLTCFG_SUBSR_CTL0 */
#define CLTCFG_SUBSR_CTL0_ENET_MODE_SEL       BIT(7)                                       /*!< ENET mode selection */
#define CLTCFG_SUBSR_CTL0_PAD_RET_CFG         BIT(16)                                      /*!< configure the IO state in the standby mode */

/* CLTCFG_SUBSR_CTL1 */
#define CLTCFG_SUBSR_CTL1_ADC0_CH8_DP         BIT(1)                                       /*!< drive pin selection for ADC0 channel 8 */
#define CLTCFG_SUBSR_CTL1_ADC0_CH9_DP         BIT(2)                                       /*!< drive pin selection for ADC0 channel 9 */
#define CLTCFG_SUBSR_CTL1_ADC1_CH14_DP        BIT(3)                                       /*!< drive pin selection for ADC1 channel 14 */
#define CLTCFG_SUBSR_CTL1_ADC1_CH15_DP        BIT(4)                                       /*!< drive pin selection for ADC1 channel 15 */
#define CLTCFG_SUBSR_CTL1_ADC1_CH22_DP        BIT(5)                                       /*!< drive pin selection for ADC1 channel 22 */
#define CLTCFG_SUBSR_CTL1_ADC1_CH23_DP        BIT(6)                                       /*!< drive pin selection for ADC1 channel 23 */
#define CLTCFG_SUBSR_CTL1_ADC2_CH8_DP         BIT(9)                                       /*!< drive pin selection for ADC2 channel 8 */
#define CLTCFG_SUBSR_CTL1_ADC2_CH9_DP         BIT(10)                                      /*!< drive pin selection for ADC2 channel 9 */
#define CLTCFG_SUBSR_CTL1_CORE0_WAIT          BIT(17)                                      /*!< configuration for CM7 core 0 wait mode */
#define CLTCFG_SUBSR_CTL1_CORE1_WAIT          BIT(18)                                      /*!< configuration for CM7 core 1 wait mode */

/* CLTCFG_SUBSR_CTL2 */
#define CLTCFG_SUBSR_CTL2_BTMOD               BIT(0)                                       /*!< SBAF application boot address after standby exit */
#define CLTCFG_SUBSR_CTL2_BTADDR              BITS(1,31)                                   /*!< configure boot mode after exiting from standby */

/* CLTCFG_TMR_CTL */
#define CLTCFG_TMR_CTL_IOTMREN                BIT(0)                                       /*!< gpio TMR enable */
#define CLTCFG_TMR_CTL_SRTMREN                BIT(1)                                       /*!< system reset TMR enable */
#define CLTCFG_TMR_CTL_BTTMREN                BIT(2)                                       /*!< boot mode TMR enable */
#define CLTCFG_TMR_CTL_WMTMREN                BIT(3)                                       /*!< wait mode TMR enable */
#define CLTCFG_TMR_CTL_SBTMREN                BIT(5)                                       /*!< standby mode TMR enable */
#define CLTCFG_TMR_CTL_WDTMREN                BIT(6)                                       /*!< watch dog TMR enable */

/* CLTCFG_TMR_STAT */
#define CLTCFG_TMR_STAT_IOTMRERR              BIT(0)                                       /*!< gpio TMR error flag bit */
#define CLTCFG_TMR_STAT_SRTMRERR              BIT(1)                                       /*!< system reset TMR error flag bit */
#define CLTCFG_TMR_STAT_BTTMRERR              BIT(2)                                       /*!< boot mode TMR error flag bit */
#define CLTCFG_TMR_STAT_WMTMRERR              BIT(3)                                       /*!< WM TMR error flag bit */
#define CLTCFG_TMR_STAT_SBTMRERR              BIT(5)                                       /*!< standby mode TMR error flag bit */
#define CLTCFG_TMR_STAT_WDTMRERR              BIT(6)                                       /*!< watch dog TMR error flag bit */

/* CLTCFG_TMR_FC */
#define CLTCFG_TMR_FC_IOTMRFC                 BIT(0)                                       /*!< gpio TMR error flag clear bit */
#define CLTCFG_TMR_FC_SRTMRFC                 BIT(1)                                       /*!< system reset TMR error flag clear bit */
#define CLTCFG_TMR_FC_BTTMRFC                 BIT(2)                                       /*!< boot mode TMR error flag clear bit */
#define CLTCFG_TMR_FC_WMTMRFC                 BIT(3)                                       /*!< WM TMR error flag clear bit */
#define CLTCFG_TMR_FC_SBTMRFC                 BIT(5)                                       /*!< standby mode TMR error flag clear bit */
#define CLTCFG_TMR_FC_WDTMRFC                 BIT(6)                                       /*!< watch dog TMR error flag clear bit */

/* CLTCFG_LC_CS */
#define CLTCFG_LC_CS_CLCS                     BITS(0,2)                                    /*!< current life cycle stage */
#define CLTCFG_LC_CS_FLCEN                    BIT(3)                                       /*!< force LC */
#define CLTCFG_LC_CS_RLCS                     BITS(4,6)                                    /*!< real life cycle stage */
#define CLTCFG_LC_CS_FTNLCS                   BITS(8,9)                                    /*!< force to next life cycle stage */

/* constants definitions */
/* ENET dma channel */
typedef enum
{
    ENET_CH0 = 1U,                                                                         /*!< ENET dma channel 0 */
    ENET_CH1                                                                               /*!< ENET dma channel 1 */
} enet_ch_enum;

/* system reset resource of upgrade function */
typedef enum
{
    FMU_REA_FAIL_UPGRADE  = BIT(3),                                                        /*!< the upgrade function of FMU_REA_FAIL reset */
    STCM_REC_FAIL_UPGRADE = BIT(4),                                                        /*!< the upgrade function of STCM_REC_FAIL reset */
    RCTL_SBSRU_UPGRADE    = BIT(6),                                                        /*!< the upgrade function of RCTL_SBSRU reset */
    LOHRST_UPGRADE        = BIT(8),                                                        /*!< the upgrade function of LOHRST reset */
    LOPRST_UPGRADE        = BIT(9),                                                        /*!< the upgrade function of LOPRST reset */
    HSM_SYS_RST_UPGRADE   = BIT(18),                                                       /*!< the upgrade function of HSM_SYS_RST reset */
    SW_SYS_RST_UPGRADE    = BIT(29),                                                       /*!< the upgrade function of SW_SYS_RST reset */
    DBG_SYS_RST_UPGRADE   = BIT(30)                                                        /*!< the upgrade function of DBG_SYS_RST reset */
} srug_enum;

/* configuration of clockout standby expose over system reset and subsystem reset */
typedef enum
{
    CKOUT1_NOT_AVAILABLE,                                                                  /*!< The CKOUT1 function is not available while system reset or subsystem reset on PM4 */
    CKOUT1_AVAILABLE                                                                       /*!< The CKOUT1 function is available while system reset or subsystem reset on PM4 */
} ckout_valid_enum;

/* power watchdog timeout value */
typedef enum
{
    POR_WDG_TIMEOUT_06_25 = (uint32_t)0x00 << 9U,                                          /*!< power watchdog timeout value = 06.25ms */
    POR_WDG_TIMEOUT_12_50 = (uint32_t)0x01 << 9U,                                          /*!< power watchdog timeout value = 12.50ms */
    POR_WDG_TIMEOUT_25_00 = (uint32_t)0x02 << 9U,                                          /*!< power watchdog timeout value = 25.00ms */
    POR_WDG_TIMEOUT_50_00 = (uint32_t)0x03 << 9U                                           /*!< power watchdog timeout value = 50.00ms */
} porwdg_timeout_enum;

/* configuration of PLL loss of lock event */
typedef enum
{
    GENERATE_A_SYS_RST = (uint32_t)0x00 << 9U,                                             /*!< generate a system reset if PLL loss of lock event occurs */
    GENERATE_AN_INT    = (uint32_t)0x01 << 9U                                              /*!< generate an interrupt if PLL loss of lock event occurs */
} lol_cfg_enum;

/* FFIO state configuration during selftest */
typedef enum
{
    CHANGE_TO_HIGH_Z_STATE = (uint32_t)0x00 << 7U,                                         /*!< FFIO will change to high Z during selftest when device is under reset */
    REMAIN_IN_FAULT_STATE  = (uint32_t)0x01 << 7U                                          /*!< FFIO will remain in fault state during selftest when device is under reset */
} ffio_state_enum;

