sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cltcfg.h
/* ENET mode */
typedef enum
{
    ENET_MII_MODE  = (uint32_t)0x00 << 7U,                                                 /*!< mii mode */
    ENET_RMII_MODE = (uint32_t)0x01 << 7U                                                  /*!< rmii mode */
} enet_mode_enum;

/* ADC channel drive pin */
typedef enum
{
    ADC0_CH8_DP_PC6   = (uint32_t)(CLTCFG_SUBSR_CTL1_ADC0_CH8_DP << 16U),                                     /*!< select the default PC6 as drive pin */
    ADC0_CH8_DP_PD13  = (uint32_t)((CLTCFG_SUBSR_CTL1_ADC0_CH8_DP << 16U)  | CLTCFG_SUBSR_CTL1_ADC0_CH8_DP),  /*!< select the PD13 as drive pin */
    ADC0_CH9_DP_PG7   = (uint32_t)(CLTCFG_SUBSR_CTL1_ADC0_CH9_DP << 16U),                                     /*!< select the default PG7 as drive pin */
    ADC0_CH9_DP_PD11  = (uint32_t)((CLTCFG_SUBSR_CTL1_ADC0_CH9_DP << 16U)  | CLTCFG_SUBSR_CTL1_ADC0_CH9_DP),  /*!< select the PD11 as drive pin */
    ADC1_CH14_DP_PA15 = (uint32_t)(CLTCFG_SUBSR_CTL1_ADC1_CH14_DP << 16U),                                    /*!< select the default PA15 as drive pin */
    ADC1_CH14_DP_PJ5  = (uint32_t)((CLTCFG_SUBSR_CTL1_ADC1_CH14_DP << 16U) | CLTCFG_SUBSR_CTL1_ADC1_CH14_DP), /*!< select the PJ5 as drive pin */
    ADC1_CH15_DP_PA13 = (uint32_t)(CLTCFG_SUBSR_CTL1_ADC1_CH15_DP << 16U),                                    /*!< select the default PA13 as drive pin */
    ADC1_CH15_DP_PB11 = (uint32_t)((CLTCFG_SUBSR_CTL1_ADC1_CH15_DP << 16U) | CLTCFG_SUBSR_CTL1_ADC1_CH15_DP), /*!< select the PB11 as drive pin */
    ADC1_CH22_DP_PG6  = (uint32_t)(CLTCFG_SUBSR_CTL1_ADC1_CH22_DP << 16U),                                    /*!< select the default PG6 as drive pin */
    ADC1_CH22_DP_PA9  = (uint32_t)((CLTCFG_SUBSR_CTL1_ADC1_CH22_DP << 16U) | CLTCFG_SUBSR_CTL1_ADC1_CH22_DP), /*!< select the PA9 as drive pin */
    ADC1_CH23_DP_PG8  = (uint32_t)(CLTCFG_SUBSR_CTL1_ADC1_CH23_DP << 16U),                                    /*!< select the default PG8 as drive pin */
    ADC1_CH23_DP_PA11 = (uint32_t)((CLTCFG_SUBSR_CTL1_ADC1_CH23_DP << 16U) | CLTCFG_SUBSR_CTL1_ADC1_CH23_DP), /*!< select the PA11 as drive pin */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    ADC2_CH8_DP_PL2   = (uint32_t)(CLTCFG_SUBSR_CTL1_ADC2_CH8_DP << 16U),                                     /*!< select the default PL2 as drive pin */
    ADC2_CH8_DP_PD13  = (uint32_t)((CLTCFG_SUBSR_CTL1_ADC2_CH8_DP << 16U)  | CLTCFG_SUBSR_CTL1_ADC2_CH8_DP),  /*!< select the PD13 as drive pin */
    ADC2_CH9_DP_PC13  = (uint32_t)(CLTCFG_SUBSR_CTL1_ADC2_CH9_DP << 16U),                                     /*!< select the default PC13 as drive pin */
    ADC2_CH9_DP_PD11  = (uint32_t)((CLTCFG_SUBSR_CTL1_ADC2_CH9_DP << 16U)  | CLTCFG_SUBSR_CTL1_ADC2_CH9_DP)   /*!< select the PD11 as drive pin */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
} drive_pin_enum;

/* core wait mode */
typedef enum
{
    CORE_0_WAIT_DIS = (uint32_t)CLTCFG_SUBSR_CTL1_CORE0_WAIT,                                                 /*!< disable CM7 core 0 wait mode */
    CORE_0_WAIT_EN  = (uint32_t)(CLTCFG_SUBSR_CTL1_CORE0_WAIT | (CLTCFG_SUBSR_CTL1_CORE0_WAIT >> 16U)),       /*!< put CM7 core 0 into wait mode by CPUWAIT */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    CORE_1_WAIT_DIS = (uint32_t)CLTCFG_SUBSR_CTL1_CORE1_WAIT,                                                 /*!< disable CM7 core 1 wait mode */
    CORE_1_WAIT_EN  = (uint32_t)(CLTCFG_SUBSR_CTL1_CORE1_WAIT | (CLTCFG_SUBSR_CTL1_CORE1_WAIT >> 16U))        /*!< put CM7 core 1 into wait mode by CPUWAIT */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
} wait_mode_enum;

/* boot mode */
typedef enum
{
    NORMAL_BOOT_MODE = 0U,                                                                                    /*!< normal boot mode */
    FAST_BOOT_MODE                                                                                            /*!< fast boot mode */
} boot_mode_enum;

/* tmr modul */
typedef enum
{
    TMR_GPIO         = (uint32_t)CLTCFG_TMR_CTL_IOTMREN,                                                      /*!< gpio tmr */
    TMR_SYSTEM_RESET = (uint32_t)CLTCFG_TMR_CTL_SRTMREN,                                                      /*!< system reset tmr */
    TMR_BOOT_MODE    = (uint32_t)CLTCFG_TMR_CTL_BTTMREN,                                                      /*!< boot mode tmr */
    TMR_WAIT_MODE    = (uint32_t)CLTCFG_TMR_CTL_WMTMREN,                                                      /*!< wait mode tmr */
    TMR_STANDBY_MODE = (uint32_t)CLTCFG_TMR_CTL_SBTMREN,                                                      /*!< standby mode tmr */
    TMR_WATCHDOG     = (uint32_t)CLTCFG_TMR_CTL_WDTMREN                                                       /*!< watchdog tmr */
} tmr_modul_enum;

/* tmr error flag */
typedef enum
{
    TMR_FLAG_IOTMRERR = (uint32_t)CLTCFG_TMR_STAT_IOTMRERR,                                                   /*!< gpio tmr error flag */
    TMR_FLAG_SRTMRERR = (uint32_t)CLTCFG_TMR_STAT_SRTMRERR,                                                   /*!< system reset tmr error flag */
    TMR_FLAG_BTTMRERR = (uint32_t)CLTCFG_TMR_STAT_BTTMRERR,                                                   /*!< boot mode tmr error flag */
    TMR_FLAG_WMTMRERR = (uint32_t)CLTCFG_TMR_STAT_WMTMRERR,                                                   /*!< wait mode tmr error flag */
    TMR_FLAG_SBTMRERR = (uint32_t)CLTCFG_TMR_STAT_SBTMRERR,                                                   /*!< standby mode tmr error flag */
    TMR_FLAG_WDTMRERR = (uint32_t)CLTCFG_TMR_STAT_WDTMRERR                                                    /*!< watchdog tmr error flag */
} tmr_err_enum;

/* life cycle */
typedef enum
{
    LC_FA                = (uint32_t)0U,                                                                      /*!< failure analysis */
    LC_UNKNOWN_STATE     = (uint32_t)1U,                                                                      /*!< unknown life cycle state */
    LC_OEM_PRODUCTION    = (uint32_t)2U,                                                                      /*!< OEM production */
    LC_CUSTOMER_DELIVERY = (uint32_t)3U,                                                                      /*!< customer delivery */
    LC_GD_PRODUCTION     = (uint32_t)6U,                                                                      /*!< GD production */
    LC_IN_FIELD          = (uint32_t)7U                                                                       /*!< in field */
} lc_enum;

/* update step number */
typedef enum
{
    LC_TEMP_NO_FORCE_UPDATE = (uint32_t)0U << 8U,                                                             /*!< no force update */
    LC_TEMP_UPDATE_NEXT_ONE = (uint32_t)1U << 8U,                                                             /*!< one step update */
    LC_TEMP_UPDATE_NEXT_TWO = (uint32_t)2U << 8U                                                              /*!< two steps update */
} lc_update_step_enum;

