sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cltcfg.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT

/* check ENET dma channel */
#define NOT_ENET_CHANNEL(channel)                            ((ENET_CH0 != (channel)) && (ENET_CH1 != (channel)))

/* check system reset upgrade resource */
#define NOT_SRUG_RESOURCE(srug)                              (((srug) != FMU_REA_FAIL_UPGRADE) && ((srug) != STCM_REC_FAIL_UPGRADE) && \
                                                              ((srug) != RCTL_SBSRU_UPGRADE)   && ((srug) != LOHRST_UPGRADE)        && \
                                                              ((srug) != LOPRST_UPGRADE)       &&  ((srug) != HSM_SYS_RST_UPGRADE)   && \
                                                              ((srug) != SW_SYS_RST_UPGRADE)   && ((srug) != DBG_SYS_RST_UPGRADE))

/* check clock out configuration */
#define NOT_CKOUT_CONFIG(config)                             ((CKOUT1_NOT_AVAILABLE != (config)) && (CKOUT1_AVAILABLE != (config)))

/* check POR watchdog timeout value */
#define NOT_TIMEOUT_VALUE(timeout)                           (POR_WDG_TIMEOUT_50_00 < (timeout))

/* check PLL loss of lock event configuration */
#define NOT_LOL_CONFIG(config)                               ((GENERATE_A_SYS_RST != (config)) && (GENERATE_AN_INT != (config)))

/* check FFIO state configuration */
#define NOT_FFIO_CONFIG(state)                               ((CHANGE_TO_HIGH_Z_STATE != (state)) && (REMAIN_IN_FAULT_STATE != (state)))

/* check ENET mode configuration */
#define NOT_ENET_MODE(mode)                                  ((ENET_MII_MODE != (mode)) && (ENET_RMII_MODE != (mode)))

/* check ADC channel drive pin */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_ADC_DRIVE_PIN(pin_sel)                           (((pin_sel) != ADC0_CH8_DP_PC6)   && ((pin_sel) != ADC0_CH8_DP_PD13)  && \
                                                              ((pin_sel) != ADC0_CH9_DP_PG7)   && ((pin_sel) != ADC0_CH9_DP_PD11)  && \
                                                              ((pin_sel) != ADC1_CH14_DP_PA15) && ((pin_sel) != ADC1_CH14_DP_PJ5)  && \
                                                              ((pin_sel) != ADC1_CH15_DP_PA13) && ((pin_sel) != ADC1_CH15_DP_PB11) && \
                                                              ((pin_sel) != ADC1_CH22_DP_PG6)  && ((pin_sel) != ADC1_CH22_DP_PA9)  && \
                                                              ((pin_sel) != ADC1_CH23_DP_PG8)  && ((pin_sel) != ADC1_CH23_DP_PA11) && \
                                                              ((pin_sel) != ADC2_CH8_DP_PL2)   && ((pin_sel) != ADC2_CH8_DP_PD13)  && \
                                                              ((pin_sel) != ADC2_CH9_DP_PC13)  && ((pin_sel) != ADC2_CH9_DP_PD11))
#else
#define NOT_ADC_DRIVE_PIN(pin_sel)                           (((pin_sel) != ADC0_CH8_DP_PC6)   && ((pin_sel) != ADC0_CH8_DP_PD13)  && \
                                                              ((pin_sel) != ADC0_CH9_DP_PG7)   && ((pin_sel) != ADC0_CH9_DP_PD11)  && \
                                                              ((pin_sel) != ADC1_CH14_DP_PA15) && ((pin_sel) != ADC1_CH14_DP_PJ5)  && \
                                                              ((pin_sel) != ADC1_CH15_DP_PA13) && ((pin_sel) != ADC1_CH15_DP_PB11) && \
                                                              ((pin_sel) != ADC1_CH22_DP_PG6)  && ((pin_sel) != ADC1_CH22_DP_PA9)  && \
                                                              ((pin_sel) != ADC1_CH23_DP_PG8)  && ((pin_sel) != ADC1_CH23_DP_PA11))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* check wait mode configuration */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_WAIT_MODE_CONFIG(config)                         (((config) != CORE_0_WAIT_DIS) && ((config) != CORE_0_WAIT_EN) && \
                                                              ((config) != CORE_1_WAIT_DIS) && ((config) != CORE_1_WAIT_EN))
#else
#define NOT_WAIT_MODE_CONFIG(config)                         (((config) != CORE_0_WAIT_DIS) && ((config) != CORE_0_WAIT_EN))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* check boot mode configuration */
#define NOT_BOOT_MODE(mode)                                  ((NORMAL_BOOT_MODE != (mode)) && (FAST_BOOT_MODE != (mode)))

/* check boot address configuration */
#define NOT_FAST_BOOT_ADDR(addr)                             (0x7FFFFFFFU < (uint32_t)addr)

/* check TMR modul */
#define NOT_TMR_MODUL(modul)                                 (((modul) != TMR_GPIO)         && ((modul) != TMR_SYSTEM_RESET) && \
                                                              ((modul) != TMR_BOOT_MODE)    && ((modul) != TMR_WAIT_MODE)    && \
                                                              ((modul) != TMR_STANDBY_MODE) && ((modul) != TMR_WATCHDOG))

/* check TMR error flag */
#define NOT_TMR_ERR_FLAG(err_flag)                           (((err_flag) != TMR_FLAG_IOTMRERR) && ((err_flag) != TMR_FLAG_SRTMRERR) && \
                                                              ((err_flag) != TMR_FLAG_BTTMRERR) && ((err_flag) != TMR_FLAG_WMTMRERR) && \
                                                              ((err_flag) != TMR_FLAG_SBTMRERR) && ((err_flag) != TMR_FLAG_WDTMRERR))

/* check life cycle update step number */
#define NOT_UPDATE_STEP_NUM(update_step)                     (((update_step) != LC_TEMP_NO_FORCE_UPDATE) && ((update_step) != LC_TEMP_UPDATE_NEXT_ONE) && \
                                                              ((update_step) != LC_TEMP_UPDATE_NEXT_TWO))

#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* clear system reset status functions */
/* get PMU input isolation state */
FlagStatus cltcfg_iso_state_get(void);
/* clear PMU input isolation state */
ErrStatus cltcfg_iso_state_clear(void);
/* get reset pin mode */
FlagStatus cltcfg_reset_pin_mode_get(void);
/* get fatal fault IO mode */
FlagStatus cltcfg_ffio_mode_get(void);

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* get the specified ENET DMA transfer channel state */
FlagStatus cltcfg_enet_ch_state_get(enet_ch_enum channel);
/* clear the specified ENET DMA transfer channel state */
ErrStatus cltcfg_enet_ch_state_clear(enet_ch_enum channel);
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* get the power watch dog state */
ControlStatus cltcfg_porwdg_status_get(void);
/* get the final-step regulator state */
ControlStatus cltcfg_fs_status_get(void);
/* get the system reset upgrade state */
FlagStatus cltcfg_sysrst_upgrade_get(srug_enum sysrst_ug);

/* configure the clock out function availability */
void cltcfg_ckout_standby_config(ckout_valid_enum config);
/* enable the the power watchdog monitor */
void cltcfg_porwdg_monitor_enable(void);
/* disable the the power watchdog monitor */
void cltcfg_porwdg_monitor_disable(void);
/* power watchdog timeout value configuration */
void cltcfg_porwdg_timeout_config(porwdg_timeout_enum timeout);
/* enable the FMU monitor */
void cltcfg_fmu_monitor_enable(void);
/* disable the FMU monitor */
void cltcfg_fmu_monitor_disable(void);
/* configure whether to generate an interrupt or a reset after PLL loss of lock event occurs */
void cltcfg_pll_lol_config(lol_cfg_enum config);

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* enable slow trace over subsystem reset */
void cltcfg_slow_trace_enable(void);
/* disable slow trace over subsystem reset */
void cltcfg_slow_trace_disable(void);
/* enable fast trace over subsystem reset */
void cltcfg_fast_trace_enable(void);
/* disable fast trace over subsystem reset */
void cltcfg_fast_trace_disable(void);
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* configure the fault reaction state during selftest */
void cltcfg_fault_reaction_config(ffio_state_enum state);

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* select the ENET mode */
void cltcfg_enet_mode_select(enet_mode_enum mode);
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* enable IO retaing function before standy entry */
void cltcfg_io_retain_enable(void);
/* disable IO retaing function after standy exit */
void cltcfg_io_retain_disable(void);
/* ADC channel pin selection */
void cltcfg_adc_drive_pin_select(drive_pin_enum pin_sel);
/* configure CM7 core wait mode */
void cltcfg_core_wait_mode_config(wait_mode_enum config);
/* configure boot mode */
void cltcfg_boot_mode_config(boot_mode_enum mode);
/* configure boot address after exiting from standby */
void cltcfg_boot_address_config(uint32_t boot_addr);

/* enable the triple modular redundancy function of specified modul */
void cltcfg_tmr_enable(tmr_modul_enum modul);
/* disable the triple modular redundancy function of specified modul */
void cltcfg_tmr_disable(tmr_modul_enum modul);
/* get the triple modular redundancy error flag of specified modul */
FlagStatus cltcfg_tmr_error_flag_get(tmr_err_enum err_flag);
/* clear the triple modular redundancy error flag of specified modul */
void cltcfg_tmr_error_flag_clear(tmr_err_enum err_flag);

/* get current chip life cycle */
lc_enum cltcfg_current_lc_get(void);
/* get real chip life cycle */
lc_enum cltcfg_real_lc_get(void);
/* enable force life cycle */
void cltcfg_force_lc_enable(void);
/* disable force life cycle */
void cltcfg_force_lc_disable(void);
/* provide provisions for a temporary life cycle update */
ErrStatus cltcfg_temporary_lc_config(lc_update_step_enum update_step);

#endif /* GD32A7XX_CLTCFG_H */
